Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisSurfaceAzimuth Property

---

"Azimuth"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceAzimuth { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisSurfaceAzimuth As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisSurfaceAzimuth {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisSurfaceAzimuth : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace